{"company":[{"id":"6694","name":"BlockSpring","summary":"Blockspring creates API's for your Python, Ruby, and R scripts, so you can call them via HTTP. No server setup required. Paste in a script, double click on variables to make them parameters in your API, and click publish. No need to think about deploying code or spinning up servers - it just works.","details":"Blockspring creates API's for your Python, Ruby, and R scripts, so you can call them via HTTP. No server setup required. Paste in a script, double click on variables to make them parameters in your API, and click publish. No need to think about deploying code or spinning up servers - it just works.","website":"https:\/\/api.blockspring.com\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/blockspring-logo.png","logo_width":"150","screenshot":null,"tags":"API-Deployment,Containers"},{"id":"11273","name":"Panamax","summary":"An open-source project that makes deploying complex containerized apps as easy as Drag-and-Drop. Panamax is a containerized app creator with an open-source app marketplace hosted in GitHub. Panamax provides a friendly interface for users of Docker, Fleet &amp; CoreOS. With Panamax, you can easily create, share and deploy any containerized app no matter how complex it might be.","details":"An open-source project that makes deploying complex containerized apps as easy as Drag-and-Drop. Panamax is a containerized app creator with an open-source app marketplace hosted in GitHub. Panamax provides a friendly interface for users of Docker, Fleet &amp; CoreOS. With Panamax, you can easily create, share and deploy any containerized app no matter how complex it might be.","website":"http:\/\/panamax.io\/","twitter":"https:\/\/twitter.com\/panamax_io","github":"https:\/\/github.com\/CenturyLinkLabs","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/panamax-logo.png","logo_width":"150","screenshot":null,"tags":"Containers"},{"id":"11274","name":"CenturyLink Labs","summary":"CenturyLink is the third largest telecommunications company in the United States and is recognized as a leader in the network services market by technology industry analyst firms. The CenturyLink Innovations Lab is the Research and Development arm of CenturyLink. The goal of the Innovations Lab is to keep CenturyLink at the bleeding edge of technological innovation. The main tenets of the Lab are:","details":"CenturyLink is the third largest telecommunications company in the United States and is recognized as a leader in the network services market by technology industry analyst firms. The CenturyLink Innovations Lab is the Research and Development arm of CenturyLink. The goal of the Innovations Lab is to keep CenturyLink at the bleeding edge of technological innovation. The main tenets of the Lab are:transparency, foresight and pragmatism.","website":"http:\/\/www.centurylinklabs.com\/","twitter":"https:\/\/twitter.com\/centurylinklabs","github":"https:\/\/github.com\/CenturyLinkLabs","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/CenturyLinkLabsLogo.png","logo_width":"150","screenshot":null,"tags":"Containers,Research"},{"id":"11306","name":"Docker","summary":"Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications. Consisting of Docker Engine, a portable, lightweight runtime and packaging tool, and Docker Hub, a cloud service for sharing applications and automating workflows, Docker enables apps to be quickly assembled from components and eliminates the friction between development, QA, and production en","details":"Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications. Consisting of Docker Engine, a portable, lightweight runtime and packaging tool, and Docker Hub, a cloud service for sharing applications and automating workflows, Docker enables apps to be quickly assembled from components and eliminates the friction between development, QA, and production environments. As a result, IT can ship faster and run the same app, unchanged, on laptops, data center VMs, and any cloud.","website":"https:\/\/www.docker.com\/","twitter":"https:\/\/twitter.com\/docker","github":"https:\/\/github.com\/docker","blog":"http:\/\/blog.docker.com\/","blogrss":"http:\/\/blog.docker.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/docker.png","logo_width":"150","screenshot":null,"tags":"Containers"},{"id":"11307","name":"OpenVZ","summary":"OpenVZ is container-based virtualization for Linux. OpenVZ creates multiple secure, isolated Linux containers (otherwise known as VEs or VPSs) on a single physical server enabling better server utilization and ensuring that applications do not conflict. Each container performs and executes exactly like a stand-alone server; a container can be rebooted independently and have root access, users, IP ","details":"OpenVZ is container-based virtualization for Linux. OpenVZ creates multiple secure, isolated Linux containers (otherwise known as VEs or VPSs) on a single physical server enabling better server utilization and ensuring that applications do not conflict. Each container performs and executes exactly like a stand-alone server; a container can be rebooted independently and have root access, users, IP addresses, memory, processes, files, applications, system libraries and configuration files.","website":"http:\/\/openvz.org\/Main_Page","twitter":"https:\/\/twitter.com\/_openvz_","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/500px-OpenVZ_complete_logo_vertical.png","logo_width":"150","screenshot":null,"tags":"Containers"},{"id":"11400","name":"StackEngine","summary":"StackEngine builds software to manage and automate Docker applications, giving organizations the power to simply and massively deploy, manage, and scale resilient applications. Our goal is to bring modern management to modern, container-centric architectures. StackEngine deeply believes that Docker and the containerization ecosystem will change the way we need to manage and automate applications a","details":"StackEngine builds software to manage and automate Docker applications, giving organizations the power to simply and massively deploy, manage, and scale resilient applications. Our goal is to bring modern management to modern, container-centric architectures. StackEngine deeply believes that Docker and the containerization ecosystem will change the way we need to manage and automate applications and services.","website":"http:\/\/stackengine.com\/","twitter":"https:\/\/twitter.com\/stackengine","github":"","blog":"http:\/\/stackengine.com\/blog\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/StackEngine_Lo_FF1-e1398284107204.jpg","logo_width":"150","screenshot":null,"tags":"Containers"},{"id":"11411","name":"Apprenda","summary":"Apprenda is the leading enterprise Platform as a Service (PaaS) powering the next generation of enterprise software development in public, private and hybrid clouds. As a foundational software layer and application run-time environment, Apprenda abstracts away the complexities of building and delivering modern software applications, enabling enterprises to turn ideas into innovations faster.","details":"Apprenda is the leading enterprise Platform as a Service (PaaS) powering the next generation of enterprise software development in public, private and hybrid clouds. As a foundational software layer and application run-time environment, Apprenda abstracts away the complexities of building and delivering modern software applications, enabling enterprises to turn ideas into innovations faster.","website":"http:\/\/apprenda.com\/","twitter":"https:\/\/twitter.com\/apprenda","github":"","blog":"http:\/\/apprenda.com\/blog\/","blogrss":"http:\/\/apprenda.com\/feed\/","logo":"","logo_width":"150","screenshot":null,"tags":".NET,Containers,Java,PaaS"},{"id":"11423","name":"ClusterHQ","summary":"Cluster HQ's mission is to make enterprise class redundancy, scalability &amp; business continuity available to every web hosting company in the world. Cluster HQ provides global replication of websites, databases and email and automatic scalability through live-migration. Its innovative new form of hosting transforms commodity infrastructure into co-operative global clusters, responding automatic","details":"Cluster HQ's mission is to make enterprise class redundancy, scalability &amp; business continuity available to every web hosting company in the world. Cluster HQ provides global replication of websites, databases and email and automatic scalability through live-migration. Its innovative new form of hosting transforms commodity infrastructure into co-operative global clusters, responding automatically to failures in seconds. This keeps customers&rsquo; data safe and servers load-balanced, even in the face of a total infrastructure melt-down. Cluster HQ fully embrace cloud thinking with our always-on, horizontally scalable, software-HA distributed system, running on commodity hardware and\/or cloud infrastructure.","website":"https:\/\/clusterhq.com\/","twitter":"https:\/\/twitter.com\/clusterhq","github":"https:\/\/github.com\/ClusterHQ","blog":"https:\/\/clusterhq.com\/blog\/","blogrss":"https:\/\/clusterhq.com\/?cat=1&feed=rss2","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/ClusterHQ_logo.jpg","logo_width":"150","screenshot":null,"tags":"Containers,Database"}],"published":"11\/08\/2014"}